import java.util.*;

class Solution {
    public int[] solution(int n, long left, long right) {
        //0,1,2,3,4,5,6,7,8
        //1,2,3,4,5,6,7,8,9
        //1,2,3,2,2,3,3,3,3
        
        
        //0,1,2,3, 4,5,6,7, 8,9 ,10,11, 12,13,14,15                    idx
        //1,2,3,4, 2,2,3,4, 3,3 ,3 ,4 , 4 ,4 ,4 ,4                     n^2배열
        
        //1,2,3,4, 5,6,7,8, 9,10,11,12, 13,14,15,16                    idx + 1
        //1,2,3,4, 2,2,3,4, 3,3 ,3 ,4 , 4 ,4 ,4 ,4                     n^2배열
        //                  10          14              크기(10^5) -> 충분히 리스트에 넣을 수 있다.
        
        
        //0 ,1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24
        //1 ,2 ,3 ,4 ,5 ,6 ,7 ,8 ,9 ,10,11,12,13,14,15,16,17,18,19,20,21,22,23,24,25
        //1 ,2 ,3 ,4 ,5 ,2 ,2 ,3, 4, 5 ,3 ,3 ,3 ,4 ,5 ,4 ,4 ,4 ,4 ,5 ,5 ,5 ,5 ,5 ,5
        //
        
        //i가 기록되지않는데 1차원 배열을 만들 수 있는건가? 
        //10^14의 길이를 갖는건데
        //그러면 left,right,n으로 이미 값이 다 정해져있는건가
        
        
        List<Long> answer = new ArrayList<>();
        
        for (long i = left; i <= right; i++) {
            if (i / n >= i % n) {
                answer.add(i / n + 1);
            }else {
                answer.add(i % n + 1);
            }
        }
        
        
        return answer.stream().mapToInt(Long::intValue).toArray();
    }
}